{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "nB" : 8,
      "top" : "dense_1__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 16,
      "blob_weights" : 3,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "data",
      "blob_biases" : 1,
      "has_tanh" : 0,
      "debug_info" : "dense_1",
      "name" : "dense_1",
      "has_prelu" : 0
    },
    {
      "nB" : 16,
      "top" : "dense_2__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 8,
      "blob_weights" : 7,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "dense_1__activation___output",
      "blob_biases" : 5,
      "has_tanh" : 0,
      "debug_info" : "dense_2",
      "name" : "dense_2",
      "has_prelu" : 0
    },
    {
      "has_prelu" : 0,
      "top" : "actions",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 11,
      "type" : "inner_product",
      "has_relu" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "dense_2__activation___output",
      "debug_info" : "dense_3",
      "has_tanh" : 0,
      "blob_biases" : 9,
      "name" : "dense_3",
      "nB" : 8
    }
  ]
}